Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD09_DFP/2.0.38/svd/ATSAMD09C13A.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SBMATRIX</name>
         <version>I76382.1.2</version>
         <description>HSB Matrix</description>
         <groupName>HMATRIXB</groupName>
         <prependToName>HMATRIXB_</prependToName>
         <baseAddress>0x41007000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x168</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <cluster>
               <dim>16</dim>
               <dimIncrement>0x8</dimIncrement>
               <name>PRS[%s]</name>
               <description/>
               <addressOffset>0x080</addressOffset>
               <register>
                  <name>PRAS</name>
                  <description>Priority A for Slave</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>M0PR</name>
                        <description>Master 0 Priority</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M1PR</name>
                        <description>Master 1 Priority</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M2PR</name>
                        <description>Master 2 Priority</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M3PR</name>
                        <description>Master 3 Priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M4PR</name>
                        <description>Master 4 Priority</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M5PR</name>
                        <description>Master 5 Priority</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M6PR</name>
                        <description>Master 6 Priority</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M7PR</name>
                        <description>Master 7 Priority</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PRBS</name>
                  <description>Priority B for Slave</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>M8PR</name>
                        <description>Master 8 Priority</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M9PR</name>
                        <description>Master 9 Priority</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M10PR</name>
                        <description>Master 10 Priority</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M11PR</name>
                        <description>Master 11 Priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M12PR</name>
                        <description>Master 12 Priority</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M13PR</name>
                        <description>Master 13 Priority</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M14PR</name>
                        <description>Master 14 Priority</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>M15PR</name>
                        <description>Master 15 Priority</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>SFR[%s]</name>
               <description>Special Function</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
